
// 나누기 연산자와 나머지 연산자 비교하기
var numberOne = 15 / 2;
var numberTwo = 15 % 2;

/* 변수 뒤에 증가 연산자 붙이기
연산식을 먼저 실행한 후 a에 1을 증가 시킴
*/
var a = 10 
var b = a++ + 5 //b는 15, a는 11

/* 변수 앞에 증가 연산자 붙이기
변수 c에 1을 증가시킨 후 연산식 실행 */
var c = 10
var d = ++c + 5 // d는 16, c는 11

// 할당 연산자
var x = 10 
/* x = x + 10 -> 20
x = x * 5 -> 100
x += 10 0 -> 110 x = x + 10
x *= 5 -> 550 x = x * 5 */

/* 연결 연산자
10 + 10 -> 20
10 + "10" -> 1010 */

/* 비교 연산자
3 == "3" -> true
3 === "3" -> false
3 != "3" -> false
3 !== "3" -> true */